; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	image1 - mode
	spectrograph0 - mode
	GroundStation1 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	Star6 - direction
	Star8 - direction
	Star13 - direction
	Star2 - direction
	Star0 - direction
	Star12 - direction
	Star10 - direction
	Star11 - direction
	Star7 - direction
	GroundStation14 - direction
	GroundStation9 - direction
	Planet15 - direction
	Planet16 - direction
	Phenomenon17 - direction
	Planet18 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 image1)
	(calibration_target instrument0 Star7)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 Star13)
	(calibration_target instrument0 Star11)
	(calibration_target instrument0 Star12)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star12)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 GroundStation9)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation14)
	(supports instrument2 spectrograph0)
	(supports instrument2 image1)
	(calibration_target instrument2 Star11)
	(calibration_target instrument2 Star10)
	(calibration_target instrument2 Star7)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 Star7)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation5)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation14)
	(calibration_target instrument4 Star7)
	(calibration_target instrument4 Star11)
	(calibration_target instrument4 Star10)
	(supports instrument5 image1)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 GroundStation9)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation14)
)
(:goal (and
	(pointing satellite0 GroundStation4)
	(have_image Planet15 image1)
	(have_image Planet16 image1)
	(have_image Phenomenon17 image1)
	(have_image Planet18 image1)
))

)

; plan
1. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 5
2. (calibrate satellite2 instrument4 groundstation14)
   added: (calibrated instrument4)
   goals met: 0 of 5
3. (turn_to satellite2 planet15 groundstation14)
   deleted: (pointing satellite2 groundstation14)
   added: (pointing satellite2 planet15)
   goals met: 0 of 5
4. (take_image satellite2 planet15 instrument4 image1)
   added: (have_image planet15 image1)
   goals met: 1 of 5
5. (turn_to satellite2 phenomenon17 planet15)
   deleted: (pointing satellite2 planet15)
   added: (pointing satellite2 phenomenon17)
   goals met: 1 of 5
6. (turn_to satellite0 groundstation4 groundstation14)
   deleted: (pointing satellite0 groundstation14)
   added: (pointing satellite0 groundstation4)
   goals met: 2 of 5
7. (take_image satellite2 phenomenon17 instrument4 image1)
   added: (have_image phenomenon17 image1)
   goals met: 3 of 5
8. (turn_to satellite2 planet16 phenomenon17)
   deleted: (pointing satellite2 phenomenon17)
   added: (pointing satellite2 planet16)
   goals met: 3 of 5
9. (take_image satellite2 planet16 instrument4 image1)
   added: (have_image planet16 image1)
   goals met: 4 of 5
10. (turn_to satellite2 planet18 planet16)
   deleted: (pointing satellite2 planet16)
   added: (pointing satellite2 planet18)
   goals met: 4 of 5
11. (take_image satellite2 planet18 instrument4 image1)
   added: (have_image planet18 image1)
   goals met: 5 of 5
